// Typedef ระบบส่ง (ฝัง Sensor )

//  Typedef ระบบ Getdata  and Setdata    + Value static ส่ง + รับ + แยก (//ข้อมูลและตัวแปรที่ต้องใช้    
//   1 ระบบ รับ - ส่ง ข้อมูล ประกอบด้วย 1ระบบรวมข้อมูลเป็นสตริงก่อนส่ง 2. ระบบแยกสตริงหลังจากที่รับมาให้เป็นตัวแปรประเภท int / float char  )  d 
// Typedef  Status  (ตัวแปรแบบBoolen )  จะเซ็คค่าเริ่มต้นเป็น false  และจะเรียกใช้จะให้สถานะเป็น true 
// ระบบจัดการงาน( Exploer)

// ระบบตรวจสอบการเชื่อมต่อและระบบเช็คสถานะของอุปกรณ์+การทำงาน 
///ประกอบด้วย 1.pin State Bluetooth  2. เทสการส่ง-รับข้อมูล
//   2. เช็คสถานะ DHT 22 (3 จุด) และทำการรับค่า(GetdataDHT) 3. เช็ค ระบบRealy 4ตัว และทำการ(GetdataRealy)  
// ระบบตรวจสอบและคำณวนการให้น้ำ และระบบให้น้ำ
//ประกอบด้วย  1 . วัดอัตราการไหลของน้ำ และนำไปคำณวนเวลาเปิด/ปิดน้ำ (จะทำงานหลังจาก ที่ Realy ทำงานไป 2  วินาที )  
// ระบบปรับความชื้น  ->   ปรับด้วยน้ำฝอยยและพัดลม(ปล.อัจตราการไหลไม่เกี่ยว เช็คจากเวลาล้วนๆ)
// RealTime  ใช้เช็คเวลาระบบและเทียบเวลาการเปิดปิดน้ำ 




